** Better presentation of Column Sizes
   #+begin_src lisp :var data=columnSizes :colnames true
     (defun third-col (data n)
       (loop for (nn bs cs . _) in data
	     when (= nn n)
	       collect cs))

     (table 3 
(row "N / Bay Span -->" 3 3.5 4 4.5 5 5.5 6)
       (loop for n from 4 to 16 do
	 (apply #'row n (third-col  data n))))
  
   #+end_src

   #+RESULTS:
   | N / Bay Span --> |     3 | 3.500 |     4 | 4.500 |     5 | 5.500 |     6 |
   |                4 | 0.300 | 0.300 | 0.300 | 0.300 | 0.300 | 0.350 | 0.350 |
   |                5 | 0.300 | 0.300 | 0.300 | 0.350 | 0.350 | 0.400 | 0.400 |
   |                6 | 0.300 | 0.300 | 0.350 | 0.350 | 0.400 | 0.450 | 0.450 |
   |                7 | 0.300 | 0.350 | 0.350 | 0.400 | 0.450 | 0.450 | 0.500 |
   |                8 | 0.300 | 0.350 | 0.350 | 0.400 | 0.400 | 0.450 | 0.500 |
   |                9 | 0.300 | 0.350 | 0.400 | 0.400 | 0.450 | 0.500 | 0.500 |
   |               10 | 0.350 | 0.350 | 0.400 | 0.450 | 0.450 | 0.500 | 0.550 |
   |               11 | 0.350 | 0.400 | 0.400 | 0.450 | 0.500 | 0.550 | 0.550 |
   |               12 | 0.350 | 0.400 | 0.450 | 0.500 | 0.500 | 0.550 | 0.600 |
   |               13 | 0.400 | 0.400 | 0.450 | 0.500 | 0.550 | 0.600 | 0.600 |
   |               14 | 0.400 | 0.450 | 0.500 | 0.500 | 0.550 | 0.600 | 0.650 |
   |               15 | 0.400 | 0.450 | 0.500 | 0.550 | 0.600 | 0.600 | 0.650 |
   |               16 | 0.400 | 0.450 | 0.500 | 0.550 | 0.600 | 0.650 | 0.700 |

